cubicBuilding.simpleFoam_kOmega_overhang12/0/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

Uref                 1.86;
Zref                 10;
zDir                 (0 1 0);
flowDir              (1 0 0);
z0                   uniform 0.1313;
zGround              uniform 0.0;
value                $internalField;

// ************************************************************************* //
