cubicBuilding.simpleFoam_kOmega_overhang12/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    #include "include/ABLConditions"

    top
    {
        type            slip;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    ground
    {
        type            nutkAtmRoughWallFunction;
        z0              $z0;
        value           uniform 0.0;
    }
    cube
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.4187;
        E               9.793;
        value           uniform 0;
    }
    windward
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.4187;
        E               9.793;
        value           uniform 0;
    }
    overhang
    {
        type            nutkWallFunction;
        Cmu             0.09;
        kappa           0.4187;
        E               9.793;
        value           uniform 0;
    }
    sides
    {
		type			slip;
    }
}
// ************************************************************************* //
