cubicBuilding.simpleFoam_kOmega_overhang12/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.05;

boundaryField
{

    top
    {
        type            slip;
    }
    inlet
    {
        type            atmBoundaryLayerInletOmega;
        #include        "include/ABLConditions"
    }
    outlet
    {
        type            zeroGradient;
    }
    ground
    {
        type            omegaWallFunction;
        value           uniform 10.86543756;
    }
    cube
    {
        type            omegaWallFunction;
        value           uniform 10.86543756;
    }
    windward
    {
        type            omegaWallFunction;
        value           uniform 10.86543756;
    }
    overhang
    {
        type            omegaWallFunction;
        value           uniform 10.86543756;
    }
    sides
    {
		type			slip;
    }
}


// ************************************************************************* //
